In [2]:
import numpy as np 
import pandas as pd

In [3]:
t = (1,2,3,4)
t[1:3]

(2, 3)

In [4]:
dictionary = {"name":["ali","veli","zübeyde","ahmet","kubra","can"],
             "age":[12,34,56,78,None,12],
             "note":[123,456,78,87654,None,89]}
dataframe1 = pd.DataFrame(dictionary) 
print(dataframe1)

      name   age     note
0      ali  12.0    123.0
1     veli  34.0    456.0
2  zübeyde  56.0     78.0
3    ahmet  78.0  87654.0
4    kubra   NaN      NaN
5      can  12.0     89.0

In [5]:
df = pd.read_csv('C:/Users/ThinkPad/Desktop/ML/week-2/data.csv')
print(df)

                                                                                                                                                                                                                                  id,"diagnosis","radius_mean","texture_mean","perimeter_mean","area_mean","smoothness_mean","compactness_mean","concavity_mean","concave points_mean","symmetry_mean","fractal_dimension_mean","radius_se","texture_se","perimeter_se","area_se","smoothness_se","compactness_se","concavity_se","concave points_se","symmetry_se","fractal_dimension_se","radius_worst","texture_worst","perimeter_worst","area_worst","smoothness_worst","compactness_worst","concavity_worst","concave points_worst","symmetry_worst","fractal_dimension_worst",
842302   M 17.99 10.38 122.80 1001.0 0.11840 0.27760 0.30010 0.14710 0.2419 0.07871 1.0950 0.9053 8.589 153.40 0.006399 0.04904 0.05373 0.01587 0.03003 0.006193 25.380 17.33 184.60 2019.0 0.16220 0.66560 0.7119 0.2654 0.4601                                            0.11890
842517   M 20.57 17.77 132.90 1326.0 0.08474 0.07864 0.08690 0.07017 0.1812 0.05667 0.5435 0.7339 3.398 74.08  0.005225 0.01308 0.01860 0.01340 0.01389 0.003532 24.990 23.41 158.80 1956.0 0.12380 0.18660 0.2416 0.1860 0.2750                                            0.08902
84300903 M 19.69 21.25 130.00 1203.0 0.10960 0.15990 0.19740 0.12790 0.2069 0.05999 0.7456 0.7869 4.585 94.03  0.006150 0.04006 0.03832 0.02058 0.02250 0.004571 23.570 25.53 152.50 1709.0 0.14440 0.42450 0.4504 0.2430 0.3613                                            0.08758
84348301 M 11.42 20.38 77.58  386.1  0.14250 0.28390 0.24140 0.10520 0.2597 0.09744 0.4956 1.1560 3.445 27.23  0.009110 0.07458 0.05661 0.01867 0.05963 0.009208 14.910 26.50 98.87  567.7  0.20980 0.86630 0.6869 0.2575 0.6638                                            0.17300
84358402 M 20.29 14.34 135.10 1297.0 0.10030 0.13280 0.19800 0.10430 0.1809 0.05883 0.7572 0.7813 5.438 94.44  0.011490 0.02461 0.05688 0.01885 0.01756 0.005115 22.540 16.67 152.20 1575.0 0.13740 0.20500 0.4000 0.1625 0.2364                                            0.07678
...                                                                                                                                                                                                                                                                             ...
926424   M 21.56 22.39 142.00 1479.0 0.11100 0.11590 0.24390 0.13890 0.1726 0.05623 1.1760 1.2560 7.673 158.70 0.010300 0.02891 0.05198 0.02454 0.01114 0.004239 25.450 26.40 166.10 2027.0 0.14100 0.21130 0.4107 0.2216 0.2060                                            0.07115
926682   M 20.13 28.25 131.20 1261.0 0.09780 0.10340 0.14400 0.09791 0.1752 0.05533 0.7655 2.4630 5.203 99.04  0.005769 0.02423 0.03950 0.01678 0.01898 0.002498 23.690 38.25 155.00 1731.0 0.11660 0.19220 0.3215 0.1628 0.2572                                            0.06637
926954   M 16.60 28.08 108.30 858.1  0.08455 0.10230 0.09251 0.05302 0.1590 0.05648 0.4564 1.0750 3.425 48.55  0.005903 0.03731 0.04730 0.01557 0.01318 0.003892 18.980 34.12 126.70 1124.0 0.11390 0.30940 0.3403 0.1418 0.2218                                            0.07820
927241   M 20.60 29.33 140.10 1265.0 0.11780 0.27700 0.35140 0.15200 0.2397 0.07016 0.7260 1.5950 5.772 86.22  0.006522 0.06158 0.07117 0.01664 0.02324 0.006185 25.740 39.42 184.60 1821.0 0.16500 0.86810 0.9387 0.2650 0.4087                                            0.12400
92751    B 7.76  24.54 47.92  181.0  0.05263 0.04362 0.00000 0.00000 0.1587 0.05884 0.3857 1.4280 2.548 19.15  0.007189 0.00466 0.00000 0.00000 0.02676 0.002783 9.456  30.37 59.16  268.6  0.08996 0.06444 0.0000 0.0000 0.2871                                            0.07039

[569 rows x 1 columns]

In [6]:
head = dataframe1.head() 
print(head)

      name   age     note
0      ali  12.0    123.0
1     veli  34.0    456.0
2  zübeyde  56.0     78.0
3    ahmet  78.0  87654.0
4    kubra   NaN      NaN

In [7]:
tail = dataframe1.tail()
print(tail)

      name   age     note
1     veli  34.0    456.0
2  zübeyde  56.0     78.0
3    ahmet  78.0  87654.0
4    kubra   NaN      NaN
5      can  12.0     89.0

In [8]:
print(dataframe1.columns)

Index(['name', 'age', 'note'], dtype='object')

In [9]:
print(dataframe1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   note    5 non-null      float64
dtypes: float64(2), object(1)
memory usage: 276.0+ bytes
None

In [10]:
print(dataframe1.dtypes)

name     object
age     float64
note    float64
dtype: object

In [11]:
print(dataframe1.describe())

             age         note
count   5.000000      5.00000
mean   38.400000  17680.00000
std    28.684491  39116.96814
min    12.000000     78.00000
25%    12.000000     89.00000
50%    34.000000    123.00000
75%    56.000000    456.00000
max    78.000000  87654.00000

In [12]:
print(dataframe1["name"]) 
print(dataframe1.loc[:, "age"])            
dataframe1["new_future"] = [1,2,3,4,5,6] 
print(dataframe1.loc[:3,"age"])
print(dataframe1.loc[:3, "name":"note"])
print(dataframe1.loc[::-1])

0        ali
1       veli
2    zübeyde
3      ahmet
4      kubra
5        can
Name: name, dtype: object
0    12.0
1    34.0
2    56.0
3    78.0
4     NaN
5    12.0
Name: age, dtype: float64
0    12.0
1    34.0
2    56.0
3    78.0
Name: age, dtype: float64
      name   age     note
0      ali  12.0    123.0
1     veli  34.0    456.0
2  zübeyde  56.0     78.0
3    ahmet  78.0  87654.0
      name   age     note  new_future
5      can  12.0     89.0           6
4    kubra   NaN      NaN           5
3    ahmet  78.0  87654.0           4
2  zübeyde  56.0     78.0           3
1     veli  34.0    456.0           2
0      ali  12.0    123.0           1

In [14]:
print(dataframe1.loc[:, "new_future"])

0    1
1    2
2    3
3    4
4    5
5    6
Name: new_future, dtype: int64

In [15]:
print(dataframe1.loc[:3, ["name","note"]])

      name     note
0      ali    123.0
1     veli    456.0
2  zübeyde     78.0
3    ahmet  87654.0

In [16]:
print(dataframe1.loc[:,:"age"])

      name   age
0      ali  12.0
1     veli  34.0
2  zübeyde  56.0
3    ahmet  78.0
4    kubra   NaN
5      can  12.0

In [17]:
print(dataframe1.iloc[:,[2]])

      note
0    123.0
1    456.0
2     78.0
3  87654.0
4      NaN
5     89.0

In [18]:
filtre1 = dataframe1.age>10
dataframe1["bool"]= filtre1
print(dataframe1.loc[:,["age","bool"]])

    age   bool
0  12.0   True
1  34.0   True
2  56.0   True
3  78.0   True
4   NaN  False
5  12.0   True

In [19]:
type(filtre1)

pandas.core.series.Series

In [20]:
filtrelenmis_data= dataframe1[filtre1] 
print(filtrelenmis_data)

      name   age     note  new_future  bool
0      ali  12.0    123.0           1  True
1     veli  34.0    456.0           2  True
2  zübeyde  56.0     78.0           3  True
3    ahmet  78.0  87654.0           4  True
5      can  12.0     89.0           6  True

In [21]:
filtre2 = dataframe1.note>100
filtrelenmis_data2 = dataframe1[filtre2&filtre1] 
print(filtrelenmis_data2)

    name   age     note  new_future  bool
0    ali  12.0    123.0           1  True
1   veli  34.0    456.0           2  True
3  ahmet  78.0  87654.0           4  True

In [ ]:
dataframe1[dataframe1.age>20]

In [22]:
mean1 = dataframe1.note.mean()
print(mean1)
mean_np= np.mean(dataframe1.note) 
print(mean_np)

17680.0
17680.0

In [23]:
dataframe1.dropna(inplace=True) 
dataframe1

      name   age     note  new_future  bool
0      ali  12.0    123.0           1  True
1     veli  34.0    456.0           2  True
2  zübeyde  56.0     78.0           3  True
3    ahmet  78.0  87654.0           4  True
5      can  12.0     89.0           6  True

In [24]:
print(dataframe1.note.mean())
dataframe1["mean"]= ["bad" if dataframe1.note.mean()>each else "good" for each in dataframe1.note]
dataframe1

17680.0

      name   age     note  new_future  bool  mean
0      ali  12.0    123.0           1  True   bad
1     veli  34.0    456.0           2  True   bad
2  zübeyde  56.0     78.0           3  True   bad
3    ahmet  78.0  87654.0           4  True  good
5      can  12.0     89.0           6  True   bad

In [25]:
dataframe1.columns = [each.upper() for each in dataframe1.columns] 

dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'NEW_FUTURE', 'BOOL', 'MEAN'], dtype='object')

In [26]:
dataframe1.drop(["NEW_FUTURE"],axis=1,inplace=True)
dataframe1

      NAME   AGE     NOTE  BOOL  MEAN
0      ali  12.0    123.0  True   bad
1     veli  34.0    456.0  True   bad
2  zübeyde  56.0     78.0  True   bad
3    ahmet  78.0  87654.0  True  good
5      can  12.0     89.0  True   bad

In [27]:
data1 = dataframe1.head()     
data2 = dataframe1.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

      NAME   AGE     NOTE  BOOL  MEAN
0      ali  12.0    123.0  True   bad
1     veli  34.0    456.0  True   bad
2  zübeyde  56.0     78.0  True   bad
3    ahmet  78.0  87654.0  True  good
5      can  12.0     89.0  True   bad
0      ali  12.0    123.0  True   bad
1     veli  34.0    456.0  True   bad
2  zübeyde  56.0     78.0  True   bad
3    ahmet  78.0  87654.0  True  good
5      can  12.0     89.0  True   bad

In [28]:
data_contact2 = pd.concat([data1,data2],axis=1)
data_contact2

      NAME   AGE     NOTE  BOOL  MEAN     NAME   AGE     NOTE  BOOL  MEAN
0      ali  12.0    123.0  True   bad      ali  12.0    123.0  True   bad
1     veli  34.0    456.0  True   bad     veli  34.0    456.0  True   bad
2  zübeyde  56.0     78.0  True   bad  zübeyde  56.0     78.0  True   bad
3    ahmet  78.0  87654.0  True  good    ahmet  78.0  87654.0  True  good
5      can  12.0     89.0  True   bad      can  12.0     89.0  True   bad

In [29]:
dataframe1["new_age"] = [each*2 for each in dataframe1.AGE]
dataframe1

      NAME   AGE     NOTE  BOOL  MEAN  new_age
0      ali  12.0    123.0  True   bad     24.0
1     veli  34.0    456.0  True   bad     68.0
2  zübeyde  56.0     78.0  True   bad    112.0
3    ahmet  78.0  87654.0  True  good    156.0
5      can  12.0     89.0  True   bad     24.0